// Задаём тип данных
let x = Array;

// Проверяем к какому типу данных относится x
if (typeof(x) === "boolean") {
    console.log(`Переменная x = ${typeof(x)}`)
} else if (typeof(x) === "number") {
    console.log(`Переменная x = ${typeof(x)}`)
} else if (typeof(x) === "string") {
    console.log(`Переменная x = ${typeof(x)}`)
} else {
    console.log("Тип х не определён!")
}

// Дана переменная x, которая может принимать любое значение. Написать программу, которая в зависимости от типа данных x выводит в консоль сообщение вида: «x — число».

// Опишите три случая: когда х = числу, строке или логическому типу. В других случаях выводите сообщение: «Тип x не определён».

// Примечание: в этом задании использовать promt не нужно.
// При возникновении проблем по ходу решения вы всегда можете обратиться к ментору в Telegram.
